# Importing libraries

In [3]:
import pandas as pd
import numpy as np
import os

In [4]:
# Defining the pathname

path = r'/Users/iMac/Library/CloudStorage/OneDrive-Personal/Data Analytics/Data Analytics Immersion/Exercise 4/2024-01_Instacart Basket Analysis'

In [5]:
# importing the “products.csv” data set from your “Original Data” folder

df_prods = pd.read_csv(os.path.join(path, '02 Data', '00 Original Data', 'products.csv'), index_col = False)

In [6]:
# importing the “orders_wrangled.csv” data set from “Prepared Data”

df_ords = pd.read_csv(os.path.join(path, '02 Data', '00 Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [7]:
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

# Finding and addressing mixed data types

In [8]:
# create dataframe

df_test = pd.DataFrame()

In [9]:
# Create a mixed-type column

df_test['mix'] = ['a', 'b', 1, True]

In [10]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [11]:
# Check for mixed types

for col in df_test.columns.tolist():
    weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].map(type)).any(axis=1)
    if len(df_test[weird]) > 0:
        print(col)

mix

# Finding and addressing missing values

In [12]:
# find columns with missing values

df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [13]:
# create a new dataframe containing only missing values within the "product_name" column

df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [14]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [15]:
df_prods.shape

(49693, 5)

In [16]:
# create a clean df_prods

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [17]:
df_prods_clean.shape

(49677, 5)

# Finding and addressing duplicate values

In [18]:
# find full duplicates within dataframe:

df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [19]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [20]:
# check the current number of rows in your df_prods_clean dataframe

df_prods_clean.shape

(49677, 5)

In [21]:
# create a clean, duplicate-free df_prods

df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [22]:
df_prods_clean_no_dups.shape

(49672, 5)

# Tidying Up and Exporting Changes

In [23]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','00 Prepared Data', 'products_checked.csv'))

In [24]:
df_prods_clean_no_dups

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

# Task 4.5

## 2. Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.

In [25]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

### The minimum "order_hour_of_day" is 0, which might be unexpected unless there's a specific reason for orders at midnight. It could be worth exploring whether this is a valid observation or a data anomaly.

### The maximum "order_number" is 100, which seems unusually high for order numbers. It might be worth investigating if this is consistent with the expected range for order numbers.

### The maximum "days_since_prior_order" is 30, which might indicate that some customers have very irregular ordering patterns. Investigating the distribution of this variable could provide more insights.

## 3. Check for mixed-type data in your df_ords dataframe.

In [26]:
# Check for mixed-type data

for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].map(type)).any(axis=1)
    if len(df_ords[weird]) > 0:
        print(col)

## 4. If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

### Since no column was returned, it can be concluded that there are no mixed-type data in df_ords

In [27]:
# Double-check df_ords data types

print(df_ords.dtypes)

Unnamed: 0                  int64
order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

## 5. Run a check for missing values in your df_ords dataframe.

In [28]:
# Find missing data

df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

## 6. Address the missing values using an appropriate method.

## 206209 missing values were found in days_since_prior_order

### Reasons may include:

### 1. First-time orders: Customers who are placing their first order might not have a prior order to calculate the days since the last order.

### 2. Order intervals longer than 30 days: Some customers might not follow a regular ordering schedule, leading to gaps in their order history.

### 3. Data entry errors: Missing values could also be the result of data entry errors or incomplete data recording.

## 7. Run a check for duplicate values in your df_ords data.

In [29]:
# Find duplicate data

df_ords_dups = df_ords[df_ords.duplicated()]

print(df_ords_dups.head())

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

## 8. Address the duplicates using an appropriate method.

### The output indicates that there are no duplicate rows in df_ords.

## 9. Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [31]:
# Export df_prods as products_checked.csv
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','00 Prepared Data', 'products_checked.csv'), index = False)

# Export df_ords as orders_checked.csv
df_ords.to_csv(os.path.join(path, '02 Data','00 Prepared Data', 'orders_checked.csv'), index = False)